# Experiments Notebook
This notebook was used locally in order to generate the code that after was used in the `etl.py` file.

## Importing libraries.

In [1]:
import pyspark
from pyspark.sql import SparkSession
from datetime import datetime, date
import pandas as pd
from pyspark.sql import Row
import logging
import numpy as np
import pandas as pd
import os
logger = logging.getLogger()
logger.setLevel(logging.CRITICAL)
spark = SparkSession.builder.appName("data-lake-spark").getOrCreate()

# from pyspark.sql.types import (
#     StringType, BooleanType, IntegerType, FloatType, DateType
# )

23/02/01 07:50:52 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

Reading data from local computer to Spark Dataframe.

In [2]:
df_log = spark.read.json("/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Data_lake_project/data/log-data/*.json")
df_song = spark.read.json("/home/felipe/Documentos/Udacity/Data Engineering Nanodegree/Data_lake_project/data/song-data/song_data/A/*/*/*.json")

## Data Wrangling
Creating SparkSQL views in order to generate all the tables necessary.

In [3]:
df_log.createOrReplaceTempView("staging_events")
df_song.createOrReplaceTempView("staging_songs")

In [4]:
spark.sql("SELECT * FROM staging_songs").toPandas().head(1)

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,ARDR4AC1187FB371A1,NaN,,NaN,Montserrat Caballé;Placido Domingo;Vicente Sar...,511.16363,1,SOBAYLL12A8C138AF9,Sono andati? Fingevo di dormire,0

In [5]:
spark.sql("SELECT * FROM staging_events").toPandas().head(1)

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Harmonia,Logged In,Ryan,M,0,Smith,655.77751,free,"San Jose-Sunnyvale-Santa Clara, CA",PUT,NextSong,1.541017e+12,583,Sehr kosmisch,200,1542241826796,"""Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/5...",26

In [6]:
user = spark.sql(
"""
WITH uniq_staging_events AS (
    SELECT 
        userid, 
        firstName,
        lastName,
        gender,
        level,
        ROW_NUMBER() OVER(PARTITION BY userid ORDER BY ts DESC) AS rank
    FROM staging_events
            WHERE userid IS NOT NULL
)
SELECT 
    CAST(userid AS STRING) AS userid,
    CAST(firstName AS STRING) AS first_name, 
    CAST(lastName AS STRING) AS last_name, 
    CAST(gender AS STRING) AS gender,
    CAST(level AS STRING) AS level
    FROM uniq_staging_events
WHERE rank = 1;
""")

In [7]:
songs = spark.sql("""
SELECT DISTINCT
    CAST(song_id AS STRING) AS song_id, 
    CAST(title AS STRING) AS title, 
    CAST(artist_id AS STRING) AS artist_id, 
    CAST(year AS INT) AS year, 
    CAST(duration AS FLOAT) AS duration
FROM staging_songs
""")

In [16]:
# Version 2 of the code
spark.sql("""
WITH songs_duplicate AS (
    SELECT
        CAST(song_id AS STRING) AS song_id, 
        CAST(title AS STRING) AS title, 
        CAST(artist_id AS STRING) AS artist_id, 
        CAST(year AS INT) AS year, 
        CAST(duration AS FLOAT) AS duration,
        ROW_NUMBER() OVER(PARTITION BY song_id ORDER BY song_id DESC) AS rank
    FROM staging_songs)
SELECT
    song_id,
    title,
    artist_id,
    year,
    duration
FROM songs_duplicate
WHERE rank = 1
""").toPandas().head(3)

,song_id,title,artist_id,year,duration
0,SOAOIBZ12AB01815BE,I Hold Your Hand In Mine [Live At Royal Albert...,ARPBNLO1187FB3D52F,2000,43.362808
1,SOBAYLL12A8C138AF9,Sono andati? Fingevo di dormire,ARDR4AC1187FB371A1,0,511.163635
2,SOBBUGU12A8C13E95D,Setting Fire to Sleeping Giants,ARMAC4T1187FB3FA4C,2004,207.777512

In [8]:
artists = spark.sql("""
SELECT
    CAST(artist_id AS STRING) AS artist_id, 
    CAST(artist_name AS STRING) AS name, 
    CAST(artist_location AS STRING) AS location, 
    CAST(artist_latitude AS FLOAT) AS lattitude, 
    CAST(artist_longitude AS FLOAT) AS longitude
FROM staging_songs
""")

In [22]:
# Version 2 of the code
spark.sql("""
WITH artists_duplicates AS (
SELECT
    CAST(artist_id AS STRING) AS artist_id, 
    CAST(artist_name AS STRING) AS name, 
    CAST(artist_location AS STRING) AS location, 
    CAST(artist_latitude AS FLOAT) AS lattitude, 
    CAST(artist_longitude AS FLOAT) AS longitude,
    ROW_NUMBER() OVER(PARTITION BY artist_id ORDER BY artist_id DESC) AS rank
FROM staging_songs
)
SELECT
    artist_id,
    name,
    location,
    lattitude,
    longitude
FROM artists_duplicates
WHERE rank = 1
""").toPandas().head(3)

            artist_id              name      location  lattitude  longitude
0  AR051KA1187B98B2FF             Wilks                      NaN        NaN
1  AR0IAWL1187B9A96D0      Danilo Perez        Panama   8.417700 -80.112778
2  AR0RCMP1187FB3F427  Billie Jo Spears  Beaumont, TX  30.086149 -94.101578

In [10]:
songplay = spark.sql("""
WITH base AS (
SELECT
    TIMESTAMP 'epoch' + (ev.ts/1000 * INTERVAL '1 second') AS start_time, 
    ev.userId AS user_id, 
    ev.level, 
    so.song_id, 
    so.artist_id, 
    ev.sessionId AS session_id, 
    ev.location, 
    ev.userAgent AS user_agent
FROM staging_events ev
LEFT JOIN staging_songs so ON so.title = ev.song
                            AND so.artist_name = ev.artist
)
SELECT
    CAST(start_time AS TIMESTAMP) AS start_time,
    CAST(user_id  AS STRING) AS user_id,
    CAST(song_id AS STRING) AS song_id,
    CAST(artist_id AS STRING) AS artist_id,
    CAST(session_id AS INT) AS session_id,
    CAST(EXTRACT(MONTH FROM start_time) AS INT) AS month,
    CAST(EXTRACT(YEAR FROM start_time) AS INT) AS year
FROM base
""")

In [11]:
time = spark.sql("""
WITH time AS (
    SELECT DISTINCT
        ts,
        TIMESTAMP 'epoch' + (ts/1000 * INTERVAL '1 second') AS start_time
    FROM staging_events
)
SELECT
    CAST(ts AS INT) AS ts,
    CAST(start_time AS TIMESTAMP) AS start_time,
    CAST(EXTRACT(HOUR FROM start_time) AS INT) AS hour,
    CAST(EXTRACT(DAY FROM start_time) AS INT) AS day,
    CAST(EXTRACT(WEEK FROM start_time) AS INT) AS week,
    CAST(EXTRACT(MONTH FROM start_time) AS INT) AS month,
    CAST(EXTRACT(YEAR FROM start_time) AS INT) AS year,
    CAST(EXTRACT(DAYOFWEEK FROM start_time) AS INT) AS weekday
FROM time
""")

## Exporting data to parquet format

In [19]:
songplay.write.partitionBy('year', 'month').parquet(os.path.join(os.getcwd(), 'songplay'))

In [20]:
time.write.partitionBy('year', 'month').parquet(os.path.join(os.getcwd(), 'time'))

In [21]:
songs.write.partitionBy('year', 'artist_id').parquet(os.path.join(os.getcwd(), 'song'))

In [25]:
user.write.partitionBy('userId').parquet(os.path.join(os.getcwd(), 'user'))

In [26]:
artists.write.partitionBy('artist_id').parquet(os.path.join(os.getcwd(), 'artists'))